{"class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_145", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 13, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_145"}}, {"class_name": "Dropout", "config": {"rate": 0.1503883947338734, "trainable": true, "name": "dropout_145"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_146", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 30, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 7]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_146"}}, {"class_name": "Dropout", "config": {"rate": 0.1503883947338734, "trainable": true, "name": "dropout_146"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_147", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_first", "filters": 35, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 4, 150], "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 6]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_147"}}, {"class_name": "Dropout", "config": {"rate": 0.1503883947338734, "trainable": true, "name": "dropout_147"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_49", "trainable": true, "data_format": "channels_first", "pool_size": [1, 17], "padding": "valid", "strides": [1, 17]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_49"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_49", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "backend": "theano"}